const COMPANY_INFOS = {
	INFINITY: {
		remarkLeft: "备注：\n" +
			"1）以上器材价格，不含税\n" +
			"（人员/器材运输/耗材，核酸检测费用，实报实销）。\n" +
			" 餐费另计，如有包餐可不计。 \n" +
			"餐费收费标准准 早餐15元/人，午餐30元/人，晚餐30元/人\n" +
			"\n" +
			"2）器材出库前3天，器材还可作调整。器材一旦出库后，\n" +
			"如不使用，不能作取消处理。\n" +
			"\n" +
			"3）凡客户租用InfinitySTUDIO器材，必须配备器材助理。\n" +
			"未配备助理，器材如有损坏全部责任由租方负责。",
		remarkRight: "助理工作收费标准：\n" +
			"1）Calltime 06:00AM-00:00AM 时间段 \n" +
			"专业助理 InfinitySTUDIO影棚：800元/人\n" +
			"（到场起计工作10小时内，超时 100元/小时/人，不设停钟）\n" +
			"\n" +
			"2）Calltime 00:00AM-06:00AM 时间段 ：1500元/人\n" +
			"（到场起计工作6小时内，超时300元/小时/人，不设停钟）\n" +
			"\n" +
			"3）非广东省内助理费用加收200元/人\n" +
			"\n" +
			"4）路程时间4-8h，人员按照半天收费\n" +
			"路程时间8h-12h，人员按照一天收费",
		BHS: "不含税，不含人员超时费用\n器材报关/运费费用实报实销",
		CLF: "实报实销",
		spaceBgColor: "4F6228",
		headerBgColor: "E2EFDA",
		//
		H_XH: "序号\nNumber",
		H_XX: "详细\nDetailed",
		H_SL: "数量\nQuantity",
		H_CZJ: "出租价/天\nUnit Price",
		H_TS: "天数\nDays",
		H_JE: "金额\nAmount",
		H_ZK: "折扣\nDiscount",
		H_ZKJE: "折扣金额\nDiscount amount",
		H_BZ: "备注\nRemarks",
		//
	},
	CG: {
		remarkLeft: "备注：\n" +
			"1）以上对账单价格，不含税。耗材/人员费用无折扣。如需发票全单加收8%服务费。\n" +
			"（人员/器材运输/耗材，境外签证费用，实报实销）。\n" +
			" 餐费另计，如有包餐可不计。\n" +
			"餐费收费标准准 早餐20元/人，午餐30元/人，晚餐30元/人【境外根据实际情况报销】\n" +
			"09:00AM-20:00PM以外时间，需要报销助理车费。\n" +
			"\n" +
			"2）器材出库前3天，器材还可作调整。器材一旦出库后，如不使用，不能作取消处理。\n" +
			"\n" +
			"3）凡客户租用CHARD GALLERY器材，必须配备器材助理。未配备助理，器材如有损坏全部责任由租方负责。\n" +
			"\n" +
			"4）拍摄结束核对费用，并在当天以微信/支付宝/银行卡转账或现金等方式支付，才能享受专属折扣。",
		remarkRight: "助理工作收费标准：\n" +
			"1）Calltime 06:00AM-00:00AM 时间段 \n" +
			"专业助理 CHARD GALLERY影棚：800元/人\n" +
			"（到场起计工作10小时内，超时 150元/小时/人，不设停钟）\n" +
			"\n" +
			"2）Calltime 00:00AM-06:00AM 时间段 ：1500元/人\n" +
			"（到场起计工作6小时内，超时300元/小时/人，不设停钟）\n" +
			"\n" +
			"3）非广州市内助理费用加收200元/人\n" +
			"\n" +
			"4）路程时间4-8h，人员按照半天收费\n" +
			"路程时间8h-12h，人员按照一天收费",
		BHS: "不含税，不含人员超时费用",
		CLF: "根据实际产生费用实报实销\n若无费用产生则无需报销",
		spaceBgColor: "D2C9B8",
		headerBgColor: "000000",
	}
}
Object.keys(COMPANY_INFOS.INFINITY).forEach(k => {
	if (k.startsWith("H_")) {
		COMPANY_INFOS.CG[k] = COMPANY_INFOS.INFINITY[k].replace(/a-zA-Z/g, "");
	}
})

export {
	COMPANY_INFOS
}